Revit 2027 API
IFCAggregateIterator.CurrentObject Property
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
internal Object CurrentObject { get; }
Friend ReadOnly Property CurrentObject As Object
	Get
internal:
virtual property Object^ CurrentObject {
	Object^ get () sealed;
}
internal abstract CurrentObject : Object with get
internal override CurrentObject : Object with get
Property Value
Object
Implements
IEnumerator.Current
See Also
Reference
IFCAggregateIterator Class
Autodesk.Revit.DB.IFC Namespace